In [3]:
import numpy as np
import pandas as pd

In [4]:
import pandas as pd

data = {
    "Ciudad": ["Bogotá", "Cali", "Medellín", "Bogotá", "Cali", "Medellín", "Cartagena"],
    "Mes": ["Enero", "Junio", "Diciembre", "Febrero", "Diciembre", "Junio", "Diciembre"],
    "Venta": [6.7, 2.5, 5.5, 2.7, 4.8, 8.3, 6.2]
}

Data = pd.DataFrame(data)
Data

      Ciudad        Mes  Venta
0     Bogotá      Enero    6.7
1       Cali      Junio    2.5
2   Medellín  Diciembre    5.5
3     Bogotá    Febrero    2.7
4       Cali  Diciembre    4.8
5   Medellín      Junio    8.3
6  Cartagena  Diciembre    6.2

In [5]:
Data

      Ciudad        Mes  Venta
0     Bogotá      Enero    6.7
1       Cali      Junio    2.5
2   Medellín  Diciembre    5.5
3     Bogotá    Febrero    2.7
4       Cali  Diciembre    4.8
5   Medellín      Junio    8.3
6  Cartagena  Diciembre    6.2

In [6]:
Data.head()

     Ciudad        Mes  Venta
0    Bogotá      Enero    6.7
1      Cali      Junio    2.5
2  Medellín  Diciembre    5.5
3    Bogotá    Febrero    2.7
4      Cali  Diciembre    4.8

In [8]:
Data.tail()

      Ciudad        Mes  Venta
2   Medellín  Diciembre    5.5
3     Bogotá    Febrero    2.7
4       Cali  Diciembre    4.8
5   Medellín      Junio    8.3
6  Cartagena  Diciembre    6.2

In [7]:
pd.DataFrame(data, columns = ["Mes","Ciudad","Venta"])

         Mes     Ciudad  Venta
0      Enero     Bogotá    6.7
1      Junio       Cali    2.5
2  Diciembre   Medellín    5.5
3    Febrero     Bogotá    2.7
4  Diciembre       Cali    4.8
5      Junio   Medellín    8.3
6  Diciembre  Cartagena    6.2

In [8]:
Data2 = pd.DataFrame(data, columns = ["Mes","Ciudad","Venta","Ganancia"])
Data2

         Mes     Ciudad  Venta Ganancia
0      Enero     Bogotá    6.7      NaN
1      Junio       Cali    2.5      NaN
2  Diciembre   Medellín    5.5      NaN
3    Febrero     Bogotá    2.7      NaN
4  Diciembre       Cali    4.8      NaN
5      Junio   Medellín    8.3      NaN
6  Diciembre  Cartagena    6.2      NaN

In [9]:
Data2.columns

Index(['Mes', 'Ciudad', 'Venta', 'Ganancia'], dtype='object')

In [10]:
Data2["Ciudad"]

0       Bogotá
1         Cali
2     Medellín
3       Bogotá
4         Cali
5     Medellín
6    Cartagena
Name: Ciudad, dtype: object

In [11]:
Data2.Mes

0        Enero
1        Junio
2    Diciembre
3      Febrero
4    Diciembre
5        Junio
6    Diciembre
Name: Mes, dtype: object

In [12]:
Data2

         Mes     Ciudad  Venta Ganancia
0      Enero     Bogotá    6.7      NaN
1      Junio       Cali    2.5      NaN
2  Diciembre   Medellín    5.5      NaN
3    Febrero     Bogotá    2.7      NaN
4  Diciembre       Cali    4.8      NaN
5      Junio   Medellín    8.3      NaN
6  Diciembre  Cartagena    6.2      NaN

In [13]:
Data2.loc[3]

Mes         Febrero
Ciudad       Bogotá
Venta           2.7
Ganancia        NaN
Name: 3, dtype: object

In [14]:
Data2.iloc[5]

Mes            Junio
Ciudad      Medellín
Venta            8.3
Ganancia         NaN
Name: 5, dtype: object

In [16]:
Data2

         Mes     Ciudad  Venta Ganancia
0      Enero     Bogotá    6.7      NaN
1      Junio       Cali    2.5      NaN
2  Diciembre   Medellín    5.5      NaN
3    Febrero     Bogotá    2.7      NaN
4  Diciembre       Cali    4.8      NaN
5      Junio   Medellín    8.3      NaN
6  Diciembre  Cartagena    6.2      NaN

In [15]:
Data2["Ganancia"] = 1.8
Data2

         Mes     Ciudad  Venta  Ganancia
0      Enero     Bogotá    6.7       1.8
1      Junio       Cali    2.5       1.8
2  Diciembre   Medellín    5.5       1.8
3    Febrero     Bogotá    2.7       1.8
4  Diciembre       Cali    4.8       1.8
5      Junio   Medellín    8.3       1.8
6  Diciembre  Cartagena    6.2       1.8

In [16]:
val = pd.Series ([1.1, 2.0, 2.5, 1.7], index = [0,3,6,4])
Data2["Ganancia"] = val
Data2

         Mes     Ciudad  Venta  Ganancia
0      Enero     Bogotá    6.7       1.1
1      Junio       Cali    2.5       NaN
2  Diciembre   Medellín    5.5       NaN
3    Febrero     Bogotá    2.7       2.0
4  Diciembre       Cali    4.8       1.7
5      Junio   Medellín    8.3       NaN
6  Diciembre  Cartagena    6.2       2.5

In [17]:
Data2["Verif"] = Data2["Mes"] == "Enero"
Data2

         Mes     Ciudad  Venta  Ganancia  Verif
0      Enero     Bogotá    6.7       1.1   True
1      Junio       Cali    2.5       NaN  False
2  Diciembre   Medellín    5.5       NaN  False
3    Febrero     Bogotá    2.7       2.0  False
4  Diciembre       Cali    4.8       1.7  False
5      Junio   Medellín    8.3       NaN  False
6  Diciembre  Cartagena    6.2       2.5  False

In [18]:
del Data2["Verif"]

In [19]:
Data2.columns

Index(['Mes', 'Ciudad', 'Venta', 'Ganancia'], dtype='object')

In [20]:
Data2

         Mes     Ciudad  Venta  Ganancia
0      Enero     Bogotá    6.7       1.1
1      Junio       Cali    2.5       NaN
2  Diciembre   Medellín    5.5       NaN
3    Febrero     Bogotá    2.7       2.0
4  Diciembre       Cali    4.8       1.7
5      Junio   Medellín    8.3       NaN
6  Diciembre  Cartagena    6.2       2.5

In [21]:
Data

      Ciudad        Mes  Venta
0     Bogotá      Enero    6.7
1       Cali      Junio    2.5
2   Medellín  Diciembre    5.5
3     Bogotá    Febrero    2.7
4       Cali  Diciembre    4.8
5   Medellín      Junio    8.3
6  Cartagena  Diciembre    6.2

In [22]:
Ventas = {"Bogotá":{"Enero":6.7,"Febrero":2.7},"Cali":{"Junio":2.5,"Diciembre":4.8},"Medellín": {"Diciembre":5.5,"Junio":6.2},"Cartagena":{"Diciembre":6.2}}

In [23]:
Data3 = pd.DataFrame(Ventas)
Data3

           Bogotá  Cali  Medellín  Cartagena
Enero         6.7   NaN       NaN        NaN
Febrero       2.7   NaN       NaN        NaN
Junio         NaN   2.5       6.2        NaN
Diciembre     NaN   4.8       5.5        6.2

In [24]:
Data3.T

           Enero  Febrero  Junio  Diciembre
Bogotá       6.7      2.7    NaN        NaN
Cali         NaN      NaN    2.5        4.8
Medellín     NaN      NaN    6.2        5.5
Cartagena    NaN      NaN    NaN        6.2

In [25]:
Data3

           Bogotá  Cali  Medellín  Cartagena
Enero         6.7   NaN       NaN        NaN
Febrero       2.7   NaN       NaN        NaN
Junio         NaN   2.5       6.2        NaN
Diciembre     NaN   4.8       5.5        6.2

In [26]:
pd.DataFrame(Ventas,index=["Junio","Diciembre"])

           Bogotá  Cali  Medellín  Cartagena
Junio         NaN   2.5       6.2        NaN
Diciembre     NaN   4.8       5.5        6.2

In [27]:
pData = {"Bogotá": Data3["Bogotá"][:-1],"Cali": Data3["Cali"][:3]}
pData

{'Bogotá': Enero      6.7
 Febrero    2.7
 Junio      NaN
 Name: Bogotá, dtype: float64,
 'Cali': Enero      NaN
 Febrero    NaN
 Junio      2.5
 Name: Cali, dtype: float64}

In [28]:
pd.DataFrame(pData)

         Bogotá  Cali
Enero       6.7   NaN
Febrero     2.7   NaN
Junio       NaN   2.5

In [29]:
Data3

           Bogotá  Cali  Medellín  Cartagena
Enero         6.7   NaN       NaN        NaN
Febrero       2.7   NaN       NaN        NaN
Junio         NaN   2.5       6.2        NaN
Diciembre     NaN   4.8       5.5        6.2

In [33]:
Data3.index.name = "Mes"
Data3.columns.name = "Ciudad"
Data3

Ciudad     Bogotá  Cali  Medellín  Cartagena
Mes
Enero         6.7   NaN       NaN        NaN
Febrero       2.7   NaN       NaN        NaN
Junio         NaN   2.5       6.2        NaN
Diciembre     NaN   4.8       5.5        6.2

In [30]:
Data3.to_numpy()

array([[6.7, nan, nan, nan],
       [2.7, nan, nan, nan],
       [nan, 2.5, 6.2, nan],
       [nan, 4.8, 5.5, 6.2]])

In [31]:
Data2

         Mes     Ciudad  Venta  Ganancia
0      Enero     Bogotá    6.7       1.1
1      Junio       Cali    2.5       NaN
2  Diciembre   Medellín    5.5       NaN
3    Febrero     Bogotá    2.7       2.0
4  Diciembre       Cali    4.8       1.7
5      Junio   Medellín    8.3       NaN
6  Diciembre  Cartagena    6.2       2.5

In [33]:
Data2.to_numpy()

array([['Enero', 'Bogotá', 6.7, 1.1],
       ['Junio', 'Cali', 2.5, nan],
       ['Diciembre', 'Medellín', 5.5, nan],
       ['Febrero', 'Bogotá', 2.7, 2.0],
       ['Diciembre', 'Cali', 4.8, 1.7],
       ['Junio', 'Medellín', 8.3, nan],
       ['Diciembre', 'Cartagena', 6.2, 2.5]], dtype=object)

Objetos índice

In [34]:
obj = pd.Series(np.arange(5), index=["A","B","C", "D","E"])
obj

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [35]:
index=obj.index
index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [36]:
index[2:]

Index(['C', 'D', 'E'], dtype='object')

In [37]:
labels = pd.Index(np.arange(5))
labels

Index([0, 1, 2, 3, 4], dtype='int64')

In [38]:

obj2 = pd.Series([1.5, 3.6, 0.5, 7.7,4.2], index=labels)
print(obj2)

0    1.5
1    3.6
2    0.5
3    7.7
4    4.2
dtype: float64

In [39]:
obj2.index is labels

True

In [40]:
Data3

           Bogotá  Cali  Medellín  Cartagena
Enero         6.7   NaN       NaN        NaN
Febrero       2.7   NaN       NaN        NaN
Junio         NaN   2.5       6.2        NaN
Diciembre     NaN   4.8       5.5        6.2

In [41]:
Data3.columns

Index(['Bogotá', 'Cali', 'Medellín', 'Cartagena'], dtype='object')

In [42]:
"Cali" in Data3.columns

True

In [43]:
"Cali" in Data3.index

False

In [44]:
pd.Index(["sol","sol","luna","luna"])

Index(['sol', 'sol', 'luna', 'luna'], dtype='object')

Funciones Esenciales

Reindexación (Reindexing)

In [45]:
obj = pd.Series([3.2, 5.0, 6.8, 7.7, 6.6], index=["b", "d", "a", "c", "e"])
obj

b    3.2
d    5.0
a    6.8
c    7.7
e    6.6
dtype: float64

In [46]:
obj2 = obj.reindex(["a","b","c","d","e"])
obj2

a    6.8
b    3.2
c    7.7
d    5.0
e    6.6
dtype: float64

In [47]:
obj3 = pd.Series(["gigante","alto", "medio", "bajo"], index=[0,2,4,6])
obj3

0    gigante
2       alto
4      medio
6       bajo
dtype: object

In [48]:
obj3.reindex(np.arange(7),method="ffill")

0    gigante
1    gigante
2       alto
3       alto
4      medio
5      medio
6       bajo
dtype: object

In [49]:
Data

      Ciudad        Mes  Venta
0     Bogotá      Enero    6.7
1       Cali      Junio    2.5
2   Medellín  Diciembre    5.5
3     Bogotá    Febrero    2.7
4       Cali  Diciembre    4.8
5   Medellín      Junio    8.3
6  Cartagena  Diciembre    6.2

In [50]:
Data = pd.DataFrame(np.arange(28).reshape((7,4)), index = ["a","b","d","e","f","g","h"],columns = ["Bogotá", "Cali", "Medellin", "Cartagena"])
Data

   Bogotá  Cali  Medellin  Cartagena
a       0     1         2          3
b       4     5         6          7
d       8     9        10         11
e      12    13        14         15
f      16    17        18         19
g      20    21        22         23
h      24    25        26         27

In [51]:
Data2

         Mes     Ciudad  Venta  Ganancia
0      Enero     Bogotá    6.7       1.1
1      Junio       Cali    2.5       NaN
2  Diciembre   Medellín    5.5       NaN
3    Febrero     Bogotá    2.7       2.0
4  Diciembre       Cali    4.8       1.7
5      Junio   Medellín    8.3       NaN
6  Diciembre  Cartagena    6.2       2.5

In [52]:
Data2 = Data.reindex(index = ["a","b","c","d","e","f","g"])
Data2

   Bogotá  Cali  Medellin  Cartagena
a     0.0   1.0       2.0        3.0
b     4.0   5.0       6.0        7.0
c     NaN   NaN       NaN        NaN
d     8.0   9.0      10.0       11.0
e    12.0  13.0      14.0       15.0
f    16.0  17.0      18.0       19.0
g    20.0  21.0      22.0       23.0

In [53]:
Data

   Bogotá  Cali  Medellin  Cartagena
a       0     1         2          3
b       4     5         6          7
d       8     9        10         11
e      12    13        14         15
f      16    17        18         19
g      20    21        22         23
h      24    25        26         27

In [54]:
Ciudad = ["Bogotá","Medellin","Barranquilla","Cartagena"]
Data.reindex(columns = Ciudad)

   Bogotá  Medellin  Barranquilla  Cartagena
a       0         2           NaN          3
b       4         6           NaN          7
d       8        10           NaN         11
e      12        14           NaN         15
f      16        18           NaN         19
g      20        22           NaN         23
h      24        26           NaN         27

In [55]:
Data.reindex(Ciudad,axis="columns")

   Bogotá  Medellin  Barranquilla  Cartagena
a       0         2           NaN          3
b       4         6           NaN          7
d       8        10           NaN         11
e      12        14           NaN         15
f      16        18           NaN         19
g      20        22           NaN         23
h      24        26           NaN         27

In [56]:
Data

   Bogotá  Cali  Medellin  Cartagena
a       0     1         2          3
b       4     5         6          7
d       8     9        10         11
e      12    13        14         15
f      16    17        18         19
g      20    21        22         23
h      24    25        26         27

In [58]:
Data.loc[["a","b","d"], ["Medellin","Cali"]]

   Medellin  Cali
a         2     1
b         6     5
d        10     9

Eliminar entradas de un eje

In [59]:
obj = pd.Series(np.arange(6.), index = ["a", "b", "c", "d", "e","f"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
f    5.0
dtype: float64

In [60]:
new_obj = obj.drop("e")
new_obj

a    0.0
b    1.0
c    2.0
d    3.0
f    5.0
dtype: float64

In [61]:
obj.drop(["e","f"])

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [62]:
Data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index=["Bogotá", "Medellin", "Cali", "Cartagena"],
                    columns = ["one","two","three","four"])
Data

           one  two  three  four
Bogotá       0    1      2     3
Medellin     4    5      6     7
Cali         8    9     10    11
Cartagena   12   13     14    15

In [63]:
Data.drop(index=["Bogotá","Cartagena"])

          one  two  three  four
Medellin    4    5      6     7
Cali        8    9     10    11

In [64]:
Data.drop(columns=["three"])

           one  two  four
Bogotá       0    1     3
Medellin     4    5     7
Cali         8    9    11
Cartagena   12   13    15

In [65]:
Data.drop("two",axis=1)

           one  three  four
Bogotá       0      2     3
Medellin     4      6     7
Cali         8     10    11
Cartagena   12     14    15

In [68]:
Data.drop(["one","three"],axis = "columns")

           two  four
Bogotá       1     3
Medellin     5     7
Cali         9    11
Cartagena   13    15

Indexación , selección y filtrado

In [69]:
obj = pd.Series(np.arange(6.), index=["a","b","c","d","e","f"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
f    5.0
dtype: float64

In [70]:
obj["c"]

np.float64(2.0)

In [128]:
obj[3]

C:\Users\nanaw\AppData\Local\Temp\ipykernel_20084\990721316.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[3]

np.float64(3.0)

In [71]:
obj[1:3]

b    1.0
c    2.0
dtype: float64

In [72]:
obj[["a","c","d"]]

a    0.0
c    2.0
d    3.0
dtype: float64

In [73]:
obj[[2,4]]

C:\Users\nanaw\AppData\Local\Temp\ipykernel_16180\2474311992.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[2,4]]

c    2.0
e    4.0
dtype: float64

In [74]:
obj[obj < 3]

a    0.0
b    1.0
c    2.0
dtype: float64

In [75]:
obj.loc[["a","c","e"]]

a    0.0
c    2.0
e    4.0
dtype: float64

In [76]:
obj1 = pd.Series([4,6,8], index=[1,0,3])
obj2 = pd.Series([4,6,8], index=["b","c","d"])

In [77]:
obj1

1    4
0    6
3    8
dtype: int64

In [78]:
obj2

b    4
c    6
d    8
dtype: int64

In [79]:
obj1[[0,1,3]]

0    6
1    4
3    8
dtype: int64

In [80]:
obj2[[0,1,2]]

C:\Users\nanaw\AppData\Local\Temp\ipykernel_20840\2179584337.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[0,1,2]]

b    4
c    6
d    8
dtype: int64

In [80]:
obj1

1    4
0    6
3    8
dtype: int64

In [81]:
obj1.iloc[[0,2,1]]

1    4
3    8
0    6
dtype: int64

In [82]:
obj2

b    4
c    6
d    8
dtype: int64

In [83]:
obj2.iloc[[0,2,1]]

b    4
d    8
c    6
dtype: int64

In [84]:
obj2.loc["b":"c"]

b    4
c    6
dtype: int64

In [85]:
obj2

b    4
c    6
d    8
dtype: int64

In [86]:
obj2.loc["b":"d"] = 7 
obj2

b    7
c    7
d    7
dtype: int64

In [87]:
Data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index=["Bogotá", "Medellin", "Cali", "Cartagena"],
                    columns = ["one","two","three","four"])
Data

           one  two  three  four
Bogotá       0    1      2     3
Medellin     4    5      6     7
Cali         8    9     10    11
Cartagena   12   13     14    15

In [88]:
Data["one"]

Bogotá        0
Medellin      4
Cali          8
Cartagena    12
Name: one, dtype: int64

In [89]:
Data[["four","one"]]

           four  one
Bogotá        3    0
Medellin      7    4
Cali         11    8
Cartagena    15   12

In [90]:
Data

           one  two  three  four
Bogotá       0    1      2     3
Medellin     4    5      6     7
Cali         8    9     10    11
Cartagena   12   13     14    15

In [91]:
Data[:3]

          one  two  three  four
Bogotá      0    1      2     3
Medellin    4    5      6     7
Cali        8    9     10    11

In [92]:
Data

           one  two  three  four
Bogotá       0    1      2     3
Medellin     4    5      6     7
Cali         8    9     10    11
Cartagena   12   13     14    15

In [93]:
Data[Data["two"] > 6]

           one  two  three  four
Cali         8    9     10    11
Cartagena   12   13     14    15

In [94]:
Data < 6

             one    two  three   four
Bogotá      True   True   True   True
Medellin    True   True  False  False
Cali       False  False  False  False
Cartagena  False  False  False  False

Selección en un DataFrame con loc e iloc

In [95]:
Data

           one  two  three  four
Bogotá       0    1      2     3
Medellin     4    5      6     7
Cali         8    9     10    11
Cartagena   12   13     14    15

In [96]:
Data.loc["Medellin"]

one      4
two      5
three    6
four     7
Name: Medellin, dtype: int64

In [97]:
Data.loc[["Medellin","Cali"]]

          one  two  three  four
Medellin    4    5      6     7
Cali        8    9     10    11

In [98]:
Data

           one  two  three  four
Bogotá       0    1      2     3
Medellin     4    5      6     7
Cali         8    9     10    11
Cartagena   12   13     14    15

In [99]:
Data.loc["Cartagena", ["one", "four"]]

one     12
four    15
Name: Cartagena, dtype: int64

In [100]:
Data.iloc[3]

one      12
two      13
three    14
four     15
Name: Cartagena, dtype: int64

In [101]:
Data.iloc[[1, 3]]

           one  two  three  four
Medellin     4    5      6     7
Cartagena   12   13     14    15

In [102]:
Data

           one  two  three  four
Bogotá       0    1      2     3
Medellin     4    5      6     7
Cali         8    9     10    11
Cartagena   12   13     14    15

In [103]:
Data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Cali, dtype: int64

In [104]:
Data.iloc[[2, 3], [3, 0, 1]]

           four  one  two
Cali         11    8    9
Cartagena    15   12   13

In [105]:
Data

           one  two  three  four
Bogotá       0    1      2     3
Medellin     4    5      6     7
Cali         8    9     10    11
Cartagena   12   13     14    15

In [106]:
Data.loc[:"Cali", "three"]

Bogotá       2
Medellin     6
Cali        10
Name: three, dtype: int64

In [107]:
Data.iloc[:, :3][Data.three > 4]

           one  two  three
Medellin     4    5      6
Cali         8    9     10
Cartagena   12   13     14

In [108]:
Data

           one  two  three  four
Bogotá       0    1      2     3
Medellin     4    5      6     7
Cali         8    9     10    11
Cartagena   12   13     14    15

In [109]:
Data.one >= 5

Bogotá       False
Medellin     False
Cali          True
Cartagena     True
Name: one, dtype: bool

In [110]:
Data.loc[Data.four >= 5]

           one  two  three  four
Medellin     4    5      6     7
Cali         8    9     10    11
Cartagena   12   13     14    15

Errores en la indexación de números enteros

In [111]:
Data4 = pd.Series(np.arange(6.))

In [157]:
Data4

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [112]:
Data4 = pd.Series(np.arange(4.), index=["a", "b", "c","d"])
Data4[-1]

C:\Users\nanaw\AppData\Local\Temp\ipykernel_16180\1426754485.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  Data4[-1]

np.float64(3.0)

In [113]:
Data4.iloc[-3]

np.float64(1.0)

In [114]:
Data4[:4]

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

Errores de la indexación encadenada

In [115]:
Data

           one  two  three  four
Bogotá       0    1      2     3
Medellin     4    5      6     7
Cali         8    9     10    11
Cartagena   12   13     14    15

In [118]:
Data.loc[:, "two"] = 2
Data

           one  two  three  four
Bogotá       0    2      2     3
Medellin     4    2      6     7
Cali         8    2     10    11
Cartagena   12    2     14    15

In [120]:
Data.iloc[3] = 4
Data

           one  two  three  four
Bogotá       0    2      2     3
Medellin     4    2      6     7
Cali         8    2     10    11
Cartagena    4    4      4     4

In [123]:
Data.loc[Data["three"] > 4]=5
Data

           one  two  three  four
Bogotá       0    2      2     3
Medellin     5    5      5     5
Cali         5    5      5     5
Cartagena    4    4      4     4

In [134]:
Data.loc[Data.three == 2]

        one  two  three  four
Bogotá    0    2      2     3

In [135]:
Data

           one  two  three  four
Bogotá       0    2      2     3
Medellin     5    5      5     5
Cali         5    5      5     5
Cartagena    4    4      4     4

In [136]:
Data.loc[Data.three == 5, "three"] = 6
Data

           one  two  three  four
Bogotá       0    2      2     3
Medellin     5    5      6     5
Cali         5    5      6     5
Cartagena    4    4      4     4